04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/damBreak3D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 5e-07;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
    }
    walls
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.0001;
        Cs              uniform 0.5;
        value           $internalField;
    }
}


// ************************************************************************* //
